bench/scale_fio/fio_logs/ext4/randwrite_4k_4.log
randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

randwrite: (groupid=0, jobs=4): err= 0: pid=248097: Thu Oct  9 16:38:49 2025
  write: IOPS=212k, BW=826MiB/s (866MB/s)(4096MiB/4957msec); 0 zone resets
    clat (nsec): min=248, max=916456, avg=1531.00, stdev=2344.07
     lat (nsec): min=269, max=917849, avg=1555.96, stdev=2346.66
    clat percentiles (nsec):
     |  1.00th=[  636],  5.00th=[  716], 10.00th=[  788], 20.00th=[  892],
     | 30.00th=[  964], 40.00th=[ 1032], 50.00th=[ 1160], 60.00th=[ 1512],
     | 70.00th=[ 1752], 80.00th=[ 2320], 90.00th=[ 2704], 95.00th=[ 2960],
     | 99.00th=[ 3600], 99.50th=[ 3888], 99.90th=[ 5216], 99.95th=[ 6880],
     | 99.99th=[93696]
   bw (  MiB/s): min= 3604, max= 3604, per=100.00%, avg=3604.61, stdev= 0.00, samples=2
   iops        : min=922780, max=922780, avg=922780.00, stdev= 0.00, samples=2
  lat (nsec)   : 250=0.01%, 500=0.05%, 750=7.39%, 1000=28.00%
  lat (usec)   : 2=40.93%, 4=23.24%, 10=0.38%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.53%, sys=20.44%, ctx=1536, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1048576,0,4 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=826MiB/s (866MB/s), 826MiB/s-826MiB/s (866MB/s-866MB/s), io=4096MiB (4295MB), run=4957-4957msec

Disk stats (read/write):
  nvme1n1: ios=170/240887, merge=0/9343, ticks=18/1744504, in_queue=1744602, util=92.83%