bench/scale_fio/fio_logs/ext4/read_128k_16.log
read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

read: (groupid=0, jobs=16): err= 0: pid=216814: Thu Oct  9 16:28:33 2025
  read: IOPS=27.7k, BW=3463MiB/s (3631MB/s)(16.0GiB/4731msec)
    clat (usec): min=7, max=6002, avg=570.77, stdev=676.57
     lat (usec): min=7, max=6003, avg=570.91, stdev=676.54
    clat percentiles (usec):
     |  1.00th=[   11],  5.00th=[   24], 10.00th=[   29], 20.00th=[   33],
     | 30.00th=[   39], 40.00th=[   45], 50.00th=[   92], 60.00th=[  537],
     | 70.00th=[  906], 80.00th=[ 1237], 90.00th=[ 1713], 95.00th=[ 1909],
     | 99.00th=[ 2147], 99.50th=[ 2343], 99.90th=[ 2737], 99.95th=[ 2933],
     | 99.99th=[ 5014]
   bw (  MiB/s): min= 3334, max= 4179, per=100.00%, avg=3483.59, stdev=24.59, samples=143
   iops        : min=26676, max=33436, avg=27867.28, stdev=196.71, samples=143
  lat (usec)   : 10=0.87%, 20=2.67%, 50=40.73%, 100=5.75%, 250=3.67%
  lat (usec)   : 500=5.57%, 750=5.90%, 1000=7.97%
  lat (msec)   : 2=24.25%, 4=2.59%, 10=0.02%
  cpu          : usr=0.39%, sys=18.63%, ctx=62428, majf=0, minf=699
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131072,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3463MiB/s (3631MB/s), 3463MiB/s-3463MiB/s (3631MB/s-3631MB/s), io=16.0GiB (17.2GB), run=4731-4731msec

Disk stats (read/write):
  nvme1n1: ios=64334/0, merge=0/0, ticks=133852/0, in_queue=133852, util=97.95%