bench/scale_fio/fio_logs/ext4/read_4k_32.log
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

read: (groupid=0, jobs=32): err= 0: pid=215532: Thu Oct  9 16:28:20 2025
  read: IOPS=703k, BW=2747MiB/s (2881MB/s)(32.0GiB/11928msec)
    clat (nsec): min=326, max=6120.9k, avg=44990.61, stdev=420574.15
     lat (nsec): min=338, max=6122.1k, avg=45053.33, stdev=420573.83
    clat percentiles (nsec):
     |  1.00th=[    516],  5.00th=[    916], 10.00th=[   1080],
     | 20.00th=[   1208], 30.00th=[   1288], 40.00th=[   1400],
     | 50.00th=[   1512], 60.00th=[   1608], 70.00th=[   1704],
     | 80.00th=[   1848], 90.00th=[   2096], 95.00th=[   2416],
     | 99.00th=[1515520], 99.50th=[4227072], 99.90th=[5341184],
     | 99.95th=[5406720], 99.99th=[5537792]
   bw (  MiB/s): min= 2686, max= 2784, per=100.00%, avg=2747.45, stdev= 0.88, samples=736
   iops        : min=687760, max=712704, avg=703344.48, stdev=226.12, samples=736
  lat (nsec)   : 500=0.85%, 750=2.50%, 1000=2.89%
  lat (usec)   : 2=81.20%, 4=10.39%, 10=0.57%, 20=0.03%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.14%, 500=0.15%, 750=0.09%, 1000=0.06%
  lat (msec)   : 2=0.20%, 4=0.34%, 10=0.57%
  cpu          : usr=1.79%, sys=7.11%, ctx=126237, majf=0, minf=424
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8388608,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2747MiB/s (2881MB/s), 2747MiB/s-2747MiB/s (2881MB/s-2881MB/s), io=32.0GiB (34.4GB), run=11928-11928msec

Disk stats (read/write):
  nvme1n1: ios=130777/0, merge=0/0, ticks=727666/0, in_queue=727666, util=99.22%